
# Урок 1

# print(2**179)
# print(1 * 2 * 3 * 4 * 5 * 6 * 7 * 8 * 9 * 10 * 11 * 12 * 13 * 14 * 16 * 17 * 18 * 19 * 20)
# print(((179*2) + (971**2))  0.5)
# print(4 / 1 - 4 / 3 + 4 / 5 - 4 / 7 + 4 /9 - 4 / 11 + 4 / 13 - 4 / 15 + 4 / 17 - 4 / 19 + 4)
# print((6 * (1 / 1**2 + 1 / 2**2 + 1 / 3**2 + 1 / 4**2 + 1 / 5**2 + 1 / 6**2 + 1 / 7**2 + 1 / 8**2 + 1 / 9**2 + 1 / 10**2))  0.5)
# print("1" * 100)
# print("Pyton" * 100)
# print(int("179" * 50)  2)
# print(((int(str(179  10) *4) / 3))  (1 / 11))

# Урок 2
# // - деление (только целое число)
# % - деление (только остаток)

# Задание A
# a = int(input())
# b = int(input())
# print((a ** 2 + b ** 2) ** 0.5)

# Задание B
# n = int(input())
# k = int(input())
# print(k // n,k % n)

# Задание C
# a = int(input())
# b = int(input())
# c = int(input())
# print((c - a )// b)

# Задание D
# a = int(input())
# print(a // 10)

# Задание E
# a = int(input())
# print(a % 10)

# Задание F
# a = int(input())
# print((a // 10) - 10)

# Задание G
# a = int(input())
# print((a%10) + ((a//10) % 10) + (a // 100))

# Задание H
# a = int(input())
# b = int(input())
# c = int(input())
# print(((a + b * 2) * c) - a)

# Задание I
# n = int(input())
# a = (n//60%24)
# b = (n%60)
# print(a,b)

# Задание J
# a = int(input())
# b = int(input())
# n = int(input())
# print((a*2),(b*2))

# Задание K
# k = int(input())
# p = int(input())
# s = int(input())
# k = k * 100 + p * k
# print(100 * s // k)

# Задание L
# k = int(input())
# n = int(input()) - 1
# print((n//k) + 1,(n % k) + 1)

# Задание M
# v = int(input())
# t = int(input())
# print(v * t % 109)

# Задание N
# n = int(input())
# print(n + 2 - n % 2)

# Задание O
# n = int(input())
# m = int(input())
# print((n * m + 1) // 2)

# Задание P
# a = int(input())
# b = int(input())
# c = int(input())
# print((a//2)+(b//2)+(c//2) + 1)

# Задание Q
# a = int(input("Введите значение переменной а: "))
# b = int(input("Введите знаечение переменной b: "))
# c=a
# a=b
# b=c
# print(a,b)

# # Задание R
# a = int(input("Введите значение переменной а: "))
# b = int(input("Введите знаечение переменной b: "))
# a&=b
# print(a,b) (не доделано)

# Задание S
# a = int(input("Введите номер урока а: "))
# c = 9 + 45*a//60
# b = a%2
# print(c, b) (не доделано)

# Задание T
# n = int(input("Введите значение переменной n: "))
# m = int(input("Введите знаечение переменной m: "))
# print((m-1)//n + 1)

# Задание U
# n = int(input("Введите значение переменной n: "))
# k = int(input("Введите знаечение переменной k: "))
# print((n - k % n) % n)

# Задание V
# h = int(input("Введите значение переменной h: "))
# a = int(input("Введите значение переменной a: "))
# b = int(input("Введите значение переменной b: "))
# print(1 + (h - a) // (a - b))

# Задание W
#n=int(input("Введите значение переменной n: "))
#print()
# не сделано

# Задание X
#a=int(input("Введите значение переменной a: "))
#b=int(input("Введите значение переменной b: "))
#print()
# не сделано

# Задание Y
# n=int(input("Введите значение переменной n: "))
# print()
# не сделано

# Задание Z
#n=int(input("Введите значение переменной n: "))
#m=int(input("Введите значение переменной m: "))
#print()
# не сделано

# Задание ZA
#n=int(input("Введите значение переменной n: "))
#m=int(input("Введите значение переменной m: "))
#print()
# не сделано

# Задание ZB
# n=int(input("Введите значение переменной n: "))
# print()
# не сделано

# Задание ZC
#a=int(input("Введите значение переменной a: "))
#b=int(input("Введите значение переменной b: "))
#print()
# не сделано

# Задание ZD
#n=int(input("Введите значение переменной n: "))
#k=int(input("Введите значение переменной k: "))
#m=int(input("Введите значение переменной m: "))
#print()
# не сделано

# Урок 3
# else - иначе
# if - если (a>0)
# != - не равно
# == - равно

# Задание A
# a = int(input())
# b = int(input())
# if a > b:
#     print(a)
# else:
#     print(b)

# Задание B
# a = int(input())
# b = int(input())
# if a > b:
#     print(1)
# if b > a:
#     print(2)
# if a == b:
#     print(0)

# Задание C
a = input()
b = input()
c = input()
n = 5
k = n%3
if k == 0:
    print()
print(b)
